Revit 2027 API
Generic.GenericSelfIllumLuminance Property
 The property labeled "Luminance" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GenericSelfIllumLuminance { get; }
Public Shared ReadOnly Property GenericSelfIllumLuminance As String
	Get
public:
static property String^ GenericSelfIllumLuminance {
	String^ get ();
}
static member GenericSelfIllumLuminance : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace